#include "FreeRTOSTask.h"
/*
***********************************************************************************
*                                   变量声明
***********************************************************************************
*/
extern unsigned char aRxBuffer[10];


/*
***********************************************************************************
*                                   任务句柄声明
***********************************************************************************
*/
	 TaskHandle_t LED0Task_Handler=NULL;
	 TaskHandle_t usart3Task_Handler=NULL;

/*
***********************************************************************************
*                                   LED0任务函数 
***********************************************************************************
*/
void led0_task(void *pvParameters)
{
    while(1)
    {
			LED1_Set(LED_OFF);
		  vTaskDelay(500);
	  	LED1_Set(LED_ON);
		  vTaskDelay(500);
    }
}

/*
***********************************************************************************
*                                   usart3任务函数 
***********************************************************************************
*/
void usart3_task(void *pvParameters)
{
	while(1)
	{
		Usart_SendString(USART3, aRxBuffer, 10);
		vTaskDelay(500);
	}
}


/*
***********************************************************************************
*                                    创建应用任务
***********************************************************************************
*/
 void start_TaskCreate(void)
{
	xTaskCreate(led0_task,    //任务函数 	
             "led0_task",   //任务名
              60,          //任务栈大小
              NULL,				  //任务参数
              1,	          //任务优先级
              &LED0Task_Handler);//任务句柄
	
	xTaskCreate(usart3_task,    //任务函数 	
             "usart3_task",   //任务名
              60,          //任务栈大小
              NULL,				  //任务参数
              2,	          //任务优先级
              &usart3Task_Handler);//任务句柄
}



